Pickup_Pkg_Gnd/PickupforPACKAGEWebService/SampleXmls/SampleFreightPickupRequest.xml

<envr:Envelope xmlns:auth="http://www.ups.com/schema/xpci/1.0/auth" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext" xmlns:envr="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:upsa="http://www.ups.com/XMLSchema/XOLTWS/upssa/v1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:wsf="http://www.ups.com/schema/wsf">
	<envr:Header>
		<wsse:Security>
			<wsse:UsernameToken>
				<wsse:Username>your_is</wsse:Username>
				<wsse:Password>your_password</wsse:Password>
			</wsse:UsernameToken>
			<upsa:UPSServiceAccessToken>
				<upsa:AccessLicenseNumber>your_license</upsa:AccessLicenseNumber>
			</upsa:UPSServiceAccessToken>
		</wsse:Security>
		<common:ClientInformation>
			<common:Property Key="TransactionID">12300</common:Property>
		</common:ClientInformation>
	</envr:Header>
	<envr:Body>
		<FreightPickupRequest xmlns="http://www.ups.com/XMLSchema/XOLTWS/FreightPickup/v1.0" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.ups.com/XMLSchema/XOLTWS/FreightPickup/v1.0
	   D:\Projects\XOLT_WebServices\schemas\FreightPickup.xsd">
			<common:Request>
				<common:RequestOption>String</common:RequestOption>
				<common:TransactionReference>
					<common:CustomerContext>String</common:CustomerContext>
					<common:TransactionIdentifier>String</common:TransactionIdentifier>
				</common:TransactionReference>
			</common:Request>
			<AdditionalComments>Loading dock A</AdditionalComments>
			<DestinationPostalCode>30076</DestinationPostalCode>
			<DestinationCountryCode>US</DestinationCountryCode>
			<Requester>
				<ThirdPartyIndicator>1</ThirdPartyIndicator>
				<AttentionName>George</AttentionName>
				<EMailAddress>email1@UPS.com</EMailAddress>
				<Name>UPS</Name>
				<Phone>
					<Number>1467476577</Number>
					<Extension>234</Extension>
				</Phone>
			</Requester>
			<ShipFrom>
				<AttentionName>sai</AttentionName>
				<Name>george</Name>
				<Address>
					<AddressLine>2010 XYZ Drive</AddressLine>
					<City>Atlanta</City>
					<StateProvinceCode>GA</StateProvinceCode>
					<PostalCode>30076</PostalCode>
					<CountryCode>US</CountryCode>
				</Address>
				<Phone>
					<Number>1566367777</Number>
					<Extension>45</Extension>
				</Phone>
				<EmailAddress>email_2@UPS.com</EmailAddress>
			</ShipFrom>
			<ShipmentDetail>
				<HazMatIndicator/>
				<PackagingType>
					<Code>BAR</Code>
					<Description>BARREL</Description>
				</PackagingType>
				<NumberOfPieces>5</NumberOfPieces>
				<DescriptionOfCommodity>fdqwd</DescriptionOfCommodity>
				<Weight>
					<UnitOfMeasurement>
						<Code>LBS</Code>
						<Description>Pounds</Description>
					</UnitOfMeasurement>
					<Value>250.78</Value>
				</Weight>
			</ShipmentDetail>
			<PickupDate>20111229</PickupDate>
			<EarliestTimeReady>1200</EarliestTimeReady>
			<LatestTimeReady>1500</LatestTimeReady>
			<PickupInstructions>String</PickupInstructions>
			<HandlingInstructions>String</HandlingInstructions>
			<SpecialInstructions>String</SpecialInstructions>
			<DeliveryInstructions>String</DeliveryInstructions>
		</FreightPickupRequest>
	</envr:Body>
</envr:Envelope>
